# Задание №6
# 📌 Напишите программу, которая запрашивает год и проверяет его на високосность.
# 📌 Распишите все возможные проверки в цепочке elif
# 📌 Откажитесь от магических чисел
# 📌 Обязательно учтите год ввода Григорианского календаря
# 📌 В коде должны быть один input и один print
# year = int(input("Введите год"))
# if year < 1582:
#     quit()
# print("28" if year % 4 != 0 or year % 100 == 0 and year % 400 == 0 else "29")
#     print("обычный")
# else:
#     print("високосный ")

# Задание №4
# 📌 Работа в консоли в режиме интерпретатора Python.
# 📌 Решите квадратное уравнение 5x2-10x-400=0 последовательно
# сохраняя переменные a, b, c, d, x1 и x2.
# 📌 *Попробуйте решить уравнения с другими значениями a, b, c.
